Can't put Corner Mullion at end joined to non-Curtain Wall.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId AdjustEndCurtainWallParameterNoCorners { get; }
  Visual Basic
Public Shared ReadOnly Property AdjustEndCurtainWallParameterNoCorners As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ AdjustEndCurtainWallParameterNoCorners {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace